package org.example;

public class Operator {
    public static void main(String[] args) {
        int x = 2; // x = 00000000 00000000 00000000 00000010

        int y = ~x;  // y = ~x = 11111111 11111111 11111111 11111101
        // y = -3
        int z = x ^ y;
        //x = 00000000 00000000 00000000 00000010
        //y = 11111111 11111111 11111111 11111101
        //z = 11111111 11111111 11111111 11111111
        //z = -1
        //x ^ ~x = -1
//        | Biểu thức | Kết quả    |
//        | --------- | ---------- |
//        | `~x`      | `-(x + 1)` |
//        | `x ^ ~x`  | `-1`       |
//        | `x ^ x`   | `0`        |
//        | `x ^ 0`   | `x`        |


        System.out.println(z);
    }
}
